app/controllers/music_services_controller.rb

INSERT INTO "music_services" ("name", "endpoint", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Fake"], ["endpoint", "http://fake.com"], ["user_id", 149617800], ["created_at", "2016-05-06 02:15:45.059124"], ["updated_at", "2016-05-06 02:15:45.059124"]]
---
  def create
    @music_service = current_user.music_services.build(music_service_params)

    if @music_service.save

DELETE FROM "music_services" WHERE "music_services"."id" = ?  [["id", 585423320]]
---
  def destroy
    @music_service.destroy

SELECT  "music_services".* FROM "music_services" WHERE "music_services"."user_id" = ? AND "music_services"."id" = ? LIMIT 1  [["user_id", 149617800], ["id", 585423320]]
---
  def set_music_service
    @music_service = current_user.music_services.find(params[:id])